---
kind: property
id: P:Autodesk.Revit.DB.TextNode.HorizontalAlignment
source: html/30de6e1a-b261-74bd-143f-3c21fcba98d1.htm
---
# Autodesk.Revit.DB.TextNode.HorizontalAlignment Property

Indicates default horizontal alignment of the text.

## Syntax (C#)
```csharp
public HorizontalTextAlignment HorizontalAlignment { get; }
```